000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектУчтенВNavision/ОбъектУчтенВNavision.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектУчтенВNavision</name>
  <resources>
    <name>ВидПередачи</name>
    <type>
      <types>EnumRef.ВидыПередачиNavision</types>
    </type>
  </resources>
  <resources>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчтеноNavision</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменаТребуется</name>
    <comment>Команда из КСУ - отменить документ!</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменаАкцептована</name>
    <comment>Отмена действия акцептована в периферии</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменаНевозможна</name>
    <comment>Документ уже поступил в обработку или обработан</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КассовыйДень</name>
    <comment>Используется при выгрузке продаж за день (Кассовый День)</comment>
    <type>
      <types>DocumentRef.КассовыйДень</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьNavision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.КорректировкаПеремещения</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ЗарплатаКВыплатеОрганизаций</types>
      <types>DocumentRef.ПереоценкаТоваровНаСкладах</types>
      <types>DocumentRef.РегистрацияПодсчетаПосетителей</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриказНаПроведениеИнвентаризацииТоваров</types>
      <types>DocumentRef.КассоваяСмена</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
      <types>DocumentRef.ПрименениеЦенНоменклатуры</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ПересчетТоваровСамостоятельный</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.РегистрацияБезналичнойОплаты</types>
      <types>DocumentRef.ОплатаОтПокупателяПлатежнойКартой</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ОрдерНаПеремещениеТоваров</types>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
      <types>DocumentRef.УстановкаЦенНоменклатуры</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.КассовыйДень</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <comment>Ресурс предназначен для фильтрации в правилах регистрации</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйОрдерНаТовары</name>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.ВозвратТоваровОтПокупателя</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>InformationRegister.ДействующиеЦеныНоменклатуры</registerRecords>
  <registerRecords>InformationRegister.ДвиженияСерийныхНомеров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаМагазинах</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснованиеПоступление</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>КлючСвязиСерийныхНомеров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>РучноеИзменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <comment>Номера подарочных сертификатов</comment>
    <attributes>
      <name>СерийныйНомер</name>
      <comment>Номер подарочного сертификата</comment>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСерийныхНомеров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйОрдерНаТовары</name>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.РеализацияТоваров</basedOn>
  <basedOn>Document.ВозвратТоваровПоставщику</basedOn>
  <registerRecords>AccumulationRegister.БонусныеБаллыПогашение</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллы</registerRecords>
  <registerRecords>InformationRegister.ДвиженияСерийныхНомеров</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиПоЗаказамПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыВРезерве</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыПоЗаказамПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаМагазинах</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СерийныеНомера</name>
    <comment>Номера подарочных сертификатов</comment>
    <attributes>
      <name>СерийныйНомер</name>
      <comment>Номер подарочного сертификата</comment>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСерийныхНомеров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСерийныхНомеров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектУчтенВNavision/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьВерсиюДанных(ОбъектСсылка)	Экспорт

	УстановитьПривилегированныйРежим(Истина);
	#Если _ Тогда
	ОбъектСсылка = Документы.ПеремещениеТоваров.ПустаяСсылка();
	#КонецЕсли

	ВерсияДанных = "";

	Попытка

		Запрос = Новый Запрос(СтрЗаменить(
		"ВЫБРАТЬ
		|	ТаблицаДокумента.ВерсияДанных КАК ВерсияДанных
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &ОбъектСсылка"
		, "Документ.ПеремещениеТоваров КАК", "Документ." + ОбъектСсылка.Метаданные().Имя + " КАК")
		);
		Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);

		РезультатЗапроса = Запрос.Выполнить();	//	LNK 28.12.2023 07:09:18

		Если НЕ РезультатЗапроса.Пустой() Тогда
		
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();

			ВерсияДанных = Выборка.ВерсияДанных;

		КонецЕсли;

	Исключение

		ТекстОшибки  = ОписаниеОшибки();
		ВерсияДанных = "";

	КонецПопытки;

	Возврат ВерсияДанных;

КонецФункции

//	LNK 28.12.2023 05:44:43
Процедура УстановитьВерсиюДанных(ДокументОбъект)	Экспорт

//	Вызывается из "ПриЗаписи" следующих документов:
//	ПеремещениеТоваров, ПриходныйОрдерНаТовары, РасходныйОрдерНаТовары 

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	#Если _ Тогда
	ДокументОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	#КонецЕсли

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаРегистра.Объект КАК Объект,
	|	ТаблицаРегистра.Магазин КАК Магазин,
	|	ТаблицаРегистра.ДатаРегистрации КАК ДатаРегистрации
	|ИЗ
	|	РегистрСведений.ОбъектУчтенВNavision КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Объект = &ДокументСсылка
	|	И НЕ ТаблицаРегистра.ВерсияОбъекта = &ВерсияОбъекта
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаРегистрации"
	);
	Запрос.УстановитьПараметр("ДокументСсылка"	, ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВерсияОбъекта"	, ДокументОбъект.ВерсияДанных);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		НаборЗаписей = РегистрыСведений.ОбъектУчтенВNavision.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.ДополнительныеСвойства.Вставить("УстановкаВерсииОбъекта", Истина);
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеПроверятьРегистрациюВОбменNavision", Истина);
		НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
		НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);

		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() Цикл

			НаборЗаписей.ОбменДанными.Получатели.Очистить();
			ОбменДаннымиСервер.УстановитьПолучателейМагазина(НаборЗаписей.ОбменДанными.Получатели, Выборка.Магазин);

			НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект);
			НаборЗаписей.Отбор.Магазин.Установить(Выборка.Магазин);
			НаборЗаписей.Прочитать();

			Для каждого ЗаписьНабора Из НаборЗаписей Цикл

				ЗаписьНабора.ВерсияОбъекта = ДокументОбъект.ВерсияДанных;

			КонецЦикла;

			НаборЗаписей.Записать();

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

//	LNK 27.01.2023 06:31:44
Функция ПолучитьУчтеноNavisionДляОснования(ДокументСсылка)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаДокументы.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ Фильтр
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары КАК ТаблицаДокументы
	|ГДЕ
	|	ТаблицаДокументы.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументы.ДокументОснование
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК ТаблицаДокументы
	|ГДЕ
	|	ТаблицаДокументы.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРегистра.УчтеноNavision КАК УчтеноNavision
	|ИЗ
	|	РегистрСведений.ОбъектУчтенВNavision КАК ТаблицаРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Фильтр КАК Фильтр
	|		ПО ТаблицаРегистра.Объект = Фильтр.ДокументОснование
	|			И (ТаблицаРегистра.УчтеноNavision)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Фильтр"
	);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли
